Catalogs/ВариантыНаладки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВариантыНаладки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыРабочихЦентров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСрокИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСрокИспользованияЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВариантыНаладки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значения реквизитов варианта наладки
// 
// Параметры:
// 	ВариантНаладки - СправочникСсылка.ВариантыНаладки
// Возвращаемое значение:
// 	См. СтруктураРеквизитовВариантаНаладки
Функция ЗначенияРеквизитовВариантаНаладки(ВариантНаладки) Экспорт
	
	Результат = СтруктураРеквизитовВариантаНаладки();
	
	Если ЗначениеЗаполнено(ВариантНаладки) Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВариантыНаладки.ВремяРаботы      КАК ВремяРаботы,
		|	ВариантыНаладки.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ВариантыНаладки КАК ВариантыНаладки
		|ГДЕ
		|	ВариантыНаладки.Ссылка = &ВариантНаладки";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ВариантНаладки", ВариантНаладки);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру реквизитов варианта наладки.
//
// Возвращаемое значение:
//  Структура - содержит:
//   * ВремяРаботы - Число
//   * ЕдиницаИзмерения - ПеречислениеСсылка.ЕдиницыИзмеренияВремени
Функция СтруктураРеквизитовВариантаНаладки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВремяРаботы", 0);
	Результат.Вставить("ЕдиницаИзмерения", Перечисления.ЕдиницыИзмеренияВремени.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Владелец")
		И Параметры.Свойство("РабочийЦентр") Тогда
		
		Параметры.Отбор.Вставить("Владелец", РедакторПроизводственногоПроцессаКлиентСервер.ВидРабочегоЦентра(Параметры.РабочийЦентр));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
